app/Controllers/Home.php

    public function index()
    {
        $minuman = new MinumanModel();
        $harian = new HarianModel();
        $member = new MemberModel();
        $registrasi = new RegistrasiModel();

        $data = [
            'minuman' => $minuman->countAllResults(),
            'harian' => $harian->countAllResults(),
            'member' => $member->countAllResults(),
            'registrasi' => $registrasi->countAllResults(),


        ];
---
SELECT COUNT(*) AS `numrows`
FROM `data_minuman`
SELECT COUNT(*) AS `numrows`
FROM `registrasi`

        function bulan($a) {
            $visitor = new RegistrasiModel();
            $bulan = $visitor->where('MONTH(tgl_aktivasi)', $a)->where('YEAR(tgl_aktivasi)', date('Y'))->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `registrasi`
WHERE MONTH(tgl_aktivasi) = 1
AND YEAR(tgl_aktivasi) = '2023'