app/Controllers/Minuman.php

SELECT *
FROM `data_minuman`
---
    public function index()
    {
        $minuman = new MinumanModel();
        $data = [
            // 'minuman' => $minuman->findAll(),
            'minuman' => $minuman->findAll(),

        ];