app/Controllers/profil.php

    public function index()
    {
        $profil = new UsersModel();
        $data = [
            // 'profil' => $profil->findAll(),
            'profil' => $profil->find(session()->get('id_users')),
            'profil' => $profil->paginate(1, 'users'),

        ];
---
SELECT *
FROM `user`
WHERE `user`.`id_user` = '10'
SELECT *
FROM `user`
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `user`

    public function update()
    {
        $profil = new UsersModel();
        $data = $profil->find($this->request->getVar('id_user'));
---
SELECT *
FROM `user`
WHERE `user`.`id_user` = '9'