app/Controllers/Registrasi.php

    public function index()
    {
        $registrasi = new RegistrasiModel();
        $data = [
            // 'registrasi' => $registrasi->findAll(),
            'registrasi' => $registrasi->findAll(),

        ];
---
SELECT *
FROM `registrasi`