app/Controllers/Rekap.php

    public function index()
    {
        $minuman = new MinumanModel();
        $harian = new HarianModel();
        $member = new MemberModel();
        $registrasi = new RegistrasiModel();

        $data = [
            'minuman' => $minuman->countAllResults(),
            'harian' => $harian->countAllResults(),
            'member' => $member->countAllResults(),
            'registrasi' => $registrasi->countAllResults(),

        ];
---
SELECT COUNT(*) AS `numrows`
FROM `data_minuman`
SELECT COUNT(*) AS `numrows`
FROM `registrasi`

    public function rekapminuman()
    {
        $minuman = new MinumanModel();
        $data = [

            'minuman' => $minuman->countAllResults(),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `data_minuman`